# Criando os nomes

In [3]:
import pandas as pd

In [4]:
nomes_f = pd.read_json('https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=f')
nomes_f

          nome  regiao      freq  rank sexo
0        MARIA       0  11694738     1    F
1          ANA       0   3079729     2    F
2    FRANCISCA       0    721637     3    F
3      ANTONIA       0    588783     4    F
4      ADRIANA       0    565621     5    F
..         ...     ...       ...   ...  ...
195     ROSANE       0     82203   196    F
196    IVONETE       0     81878   197    F
197    LUCIANE       0     81230   198    F
198    ISADORA       0     81100   199    F
199      NILZA       0     80128   200    F

[200 rows x 5 columns]

In [5]:
nomes_m = pd.read_json('https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=m')
nomes_m

          nome  regiao     freq  rank sexo
0         JOSE       0  5732508     1    M
1         JOAO       0  2971935     2    M
2      ANTONIO       0  2567494     3    M
3    FRANCISCO       0  1765197     4    M
4       CARLOS       0  1483121     5    M
..         ...     ...      ...   ...  ...
195     WALTER       0    67207   196    M
196    ARLINDO       0    66669   197    M
197    MICHAEL       0    65736   198    M
198     ALVARO       0    65444   199    M
199    GEOVANE       0    65435   200    M

[200 rows x 5 columns]

In [6]:
nomes_f.sample(5)

         nome  regiao    freq  rank sexo
97    BARBARA       0  170703    98    F
182   LIDIANE       0   86963   183    F
59     ISABEL       0  238919    60    F
81    MICHELE       0  200531    82    F
66   PRISCILA       0  222460    67    F

In [7]:
nomes_m.sample(5)

          nome  regiao    freq  rank sexo
15       BRUNO       0  663271    16    M
56     DOUGLAS       0  264889    57    M
122       ADAO       0  121982   123    M
170  ALEXANDRO       0   76472   171    M
161     DAMIAO       0   79047   162    M

In [8]:
print('Quantidade de nomes: {}'.format(len(nomes_f) + len(nomes_m)))

Quantidade de nomes: 400

In [9]:
frames = [nomes_f, nomes_m]

In [10]:
nomes = pd.concat(frames)['nome'].to_frame()

In [11]:
nomes.sample(5)

          nome
184    MARILIA
182    CHARLES
196    IVONETE
177  CLAUDINEI
45     ADRIANO

# Incluindo ID dos alunos

In [12]:
import numpy as np

In [13]:
np.random.seed(123)

In [14]:
total_alunos = len(nomes)
total_alunos

400

In [15]:
nomes['ID Aluno'] = np.random.permutation(total_alunos) + 1

In [16]:
nomes

          nome  ID Aluno
0        MARIA       235
1          ANA        43
2    FRANCISCA       304
3      ANTONIA       156
4      ADRIANA       343
..         ...       ...
195     WALTER       231
196    ARLINDO        99
197    MICHAEL       323
198     ALVARO       383
199    GEOVANE       366

[400 rows x 2 columns]

In [17]:
dominios = ['@gmail.com', '@hotmail.com']
nomes['Domínio'] = np.random.choice(dominios, total_alunos)
nomes

          nome  ID Aluno       Domínio
0        MARIA       235    @gmail.com
1          ANA        43  @hotmail.com
2    FRANCISCA       304  @hotmail.com
3      ANTONIA       156  @hotmail.com
4      ADRIANA       343  @hotmail.com
..         ...       ...           ...
195     WALTER       231    @gmail.com
196    ARLINDO        99  @hotmail.com
197    MICHAEL       323    @gmail.com
198     ALVARO       383  @hotmail.com
199    GEOVANE       366  @hotmail.com

[400 rows x 3 columns]

In [18]:
nomes['E-mail'] = nomes.nome.str.cat(nomes['Domínio']).str.lower()

In [19]:
nomes.head(5)

        nome  ID Aluno       Domínio                 E-mail
0      MARIA       235    @gmail.com        maria@gmail.com
1        ANA        43  @hotmail.com        ana@hotmail.com
2  FRANCISCA       304  @hotmail.com  francisca@hotmail.com
3    ANTONIA       156  @hotmail.com    antonia@hotmail.com
4    ADRIANA       343  @hotmail.com    adriana@hotmail.com

# Criando Tabela de Cursos

In [20]:
import html5lib
import lxml

In [22]:
url = 'http://tabela-cursos.herokuapp.com/index.html'
cursos = pd.read_html(url)
cursos

[                          Nome do curso
 0                 Lógica de programação
 1                         Java para Web
 2                           C# para Web
 3                         Ruby on Rails
 4                      Cursos de Python
 5                         PHP com MySql
 6                         .NET para web
 7            Novas integrações com Java
 8                          TDD com Java
 9                   Código limpo com C#
 10  Preparatório para certificação Java
 11                      Hardware básico
 12                Persistência com .NET
 13                  Desenvolvendo jogos
 14                     Análise de dados
 15                   Estatística básica
 16                  Internet das coisas
 17                Programação funcional
 18                Boas práticas em Java
 19          Orientação objetos com Java]

In [23]:
type(cursos)

list

In [25]:
cursos = cursos[0]

In [26]:
type(cursos)

pandas.core.frame.DataFrame

In [27]:
cursos.head(5)

           Nome do curso
0  Lógica de programação
1          Java para Web
2            C# para Web
3          Ruby on Rails
4       Cursos de Python

# Alterando Index de Cursos

In [28]:
cursos.rename(columns={'Nome do curso': 'nome_do_curso'}, inplace=True)

In [29]:
cursos

                          nome_do_curso
0                 Lógica de programação
1                         Java para Web
2                           C# para Web
3                         Ruby on Rails
4                      Cursos de Python
5                         PHP com MySql
6                         .NET para web
7            Novas integrações com Java
8                          TDD com Java
9                   Código limpo com C#
10  Preparatório para certificação Java
11                      Hardware básico
12                Persistência com .NET
13                  Desenvolvendo jogos
14                     Análise de dados
15                   Estatística básica
16                  Internet das coisas
17                Programação funcional
18                Boas práticas em Java
19          Orientação objetos com Java

In [30]:
cursos['ID'] = cursos.index + 1

In [31]:
cursos.head()

           nome_do_curso  ID
0  Lógica de programação   1
1          Java para Web   2
2            C# para Web   3
3          Ruby on Rails   4
4       Cursos de Python   5

In [33]:
cursos.set_index('ID', inplace=True)

In [34]:
cursos.head()

            nome_do_curso
ID
1   Lógica de programação
2           Java para Web
3             C# para Web
4           Ruby on Rails
5        Cursos de Python